Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t
Serialization structure for Bolt Item Enumerator

Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t.MoreBoltItemsLeft
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t.IndexToStart
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t.nBoltItems
Number of the profile items in the enumerator.

Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t.aBoltItemNames
Bolt grades list.

Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t.aBoltItemTypes
Bolt types list.

Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t.aBoltItemSizes
Bolt sizes list.

Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t.ClientId
DO NOT USE! For internal usage only!